app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "start_date", "event_venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "WENA"], ["description", "hola"], ["start_date", "2019-04-10"], ["event_venue_id", 1], ["created_at", "2019-04-10 14:14:54.483565"], ["updated_at", "2019-04-10 14:14:54.483565"]]
---
  def create
     @event = Event.create!(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "CHAO"], ["updated_at", "2019-04-10 14:34:35.512810"], ["id", 5]]
---
  def update
     @event = Event.find(params[:id])
     @event.update_attributes!(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
     @events = Event.find(params[:id])