app/controllers/event_venues_controller.rb

  def index
     @venues = EventVenue.all
---
SELECT "event_venues".* FROM "event_venues"

  def show
     @venues = EventVenue.find(params[:id])
---
SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
     @eventvenue = EventVenue.create!(eventvenue_params)
---
INSERT INTO "event_venues" ("name", "address", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "WENA"], ["address", "hola"], ["capacity", 100], ["created_at", "2019-04-10 14:19:19.734790"], ["updated_at", "2019-04-10 14:19:19.734790"]]