app/controllers/ticket_types_controller.rb

SELECT "ticket_types".* FROM "ticket_types"
---
  def index
     @ticket_types = TicketType.all

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
     @ticket_types = TicketType.find(params[:id])