app/controllers/tickets_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ? LIMIT ?  [["ticket_type_id", 2], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 9]]
---
  def index
     if(params.has_key?(:ticket_type_id))
        @tickets = Ticket.where(:ticket_type_id => params[:ticket_type_id])
     else
        @tickets = Ticket.all

INSERT INTO "tickets" ("ticket_type_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticket_type_id", 1], ["order_id", 1], ["created_at", "2019-04-10 14:24:36.298339"], ["updated_at", "2019-04-10 14:24:36.298339"]]
---
  def create
     @ticket = Ticket.create!(ticket_params)

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 4]]
---
  def destroy
     @ticket = Ticket.find(params[:id])
     @ticket.destroy