app/controllers/users_controller.rb

  def create
     @user = User.create!(user_params)
---
INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)